// 1.Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// Console.WriteLine("Введите трехзначное число: ");
// int A = Convert.ToInt32(Console.ReadLine());
// int num = A / 10 % 10;
// Console.WriteLine(num);

// 2.Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

// Console.WriteLine("Введите число: ");
// int A = Convert.ToInt32(Console.ReadLine());
// if(A < 100)
// {
//     Console.WriteLine(" 3 числа нет");
//     return;
// }
// while( A > 999)
// {
//     A = A / 10;
// }

// Console.WriteLine(A % 10 );

// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

// Console.WriteLine("Введите день недели ");
// int A = Convert.ToInt32(Console.ReadLine());
// string result = "";
// if( A == 6 |  A == 7 )
// {
//   result = "Да";   
// }
// else
// {
//     result = "Нет";   
// }

// Console.WriteLine(result);