// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
//  Console.WriteLine("Введите пятизначное число ");
//  int A = Convert.ToInt32(Console.ReadLine());
//  string L =  Convert.ToString(A);
// char[] ar = L.ToCharArray();
// Array.Reverse(ar);
// string s = new String(ar);
// int f = Convert.ToInt32(s);
// if( f == A )
// {
//   Console.WriteLine("ДА");  
// }
// else
// {
//     Console.WriteLine("НЕТ");  
// }


