// 1.Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// Console.WriteLine("Введите первое число: ");
// int A = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите второе число: ");
// int B = Convert.ToInt32(Console.ReadLine());
// if(A == B)
// {
//     Console.Write("Error");
// }
// else
// if(A > B)
//     {
//         Console.Write($"{A} - max {B} - min");
//     }
//     else
//     {
//         Console.Write($"{B} - max {A} - min");
//     }

// 2. Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// Console.WriteLine("Введите первое число: ");
// int A = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите второе число: ");
// int B = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите третье число: ");
// int C = Convert.ToInt32(Console.ReadLine());
// int max_num = A; 
// if(B > max_num) max_num = B;
// if(C > max_num) max_num = C;
// Console.WriteLine($"Максимальное число {max_num}");

// 3.Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// Console.WriteLine("Введите число: ");
// int A = Convert.ToInt32(Console.ReadLine());
// if(A % 2 ==0)
// {
//     Console.Write($"{A} четное");
// }
// else
// {
//     Console.Write($"{A} нечетное");
// }

// 4.Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

// Console.WriteLine("Введите число: ");
// int A = Convert.ToInt32(Console.ReadLine());
// int Num = 1;
// while(Num <= A )
// {
//     if(Num % 2 == 0)
//     {
//         Console.WriteLine(Num);
//     }
//     Num = Num + 1;
// }

